
//
//
Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);
	ЭтотОбъект.ПризнакИзменения = СокрЛП(Новый УникальныйИдентификатор);
	ЭтотОбъект.ClientID = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование).УникальныйИдентификатор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступКСпискамИнформационныхБаз.Ссылка
		|ИЗ
		|	Справочник.ДоступКСпискамИнформационныхБаз КАК ДоступКСпискамИнформационныхБаз
		|ГДЕ
		|	ДоступКСпискамИнформационныхБаз.ClientID = &ClientID";	
	Запрос.УстановитьПараметр("ClientID", ЭтотОбъект.ClientID);
	Если НЕ ЭтоНовый() Тогда 
		Запрос.Текст = Запрос.Текст +  " И ДоступКСпискамИнформационныхБаз.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Доступ для пользователя <" + СокрЛП(ЭтотОбъект.Наименование) + "> уже определен!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
