
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры <> Неопределено Тогда
		ЭтаФорма.ИнформационнаяБаза = ЭтаФорма.Параметры.ИнформационнаяБаза;
	КонецЕсли;    
	
	ВыполнятьВФоне = ОбщегоНазначенияСервер.ДопустимоИспользованиеФайловыхЗаданий();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	
	
	МассивАктивныхСоединений = ЗадачиНаСервере.ПолучитьМассивАктивныхСоединений(ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(ЭтаФорма.ИнформационнаяБаза));
	
	Для Каждого ТекущееЗначение Из МассивАктивныхСоединений Цикл
		
		ФоновыеЗадания.Выполнить(
		
	КонецЦикла;
	
	МассивАктивныхСоединений = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Не указана информационная база!");
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьВФоне Тогда
		
		Результат = ФоновыеПроцессыМенеджерСервер.ПроверкаАктивностиФоновогоЗаданияСервер(КлючФоновогоЗадания);
		
		ЗаданиеАктиво = Ложь;		
		Для Каждого ТекущееЗначениеРезультат Из Результат Цикл
			ЗаданиеАктиво = ЗаданиеАктиво ИЛИ ТекущееЗначениеРезультат.Активно;
		КонецЦикла;
		
		Если ЗаданиеАктиво Тогда
			ПоказатьПредупреждение(, "Процесс уже запущен");
		Иначе			
			ЗапуститьФоновоеЗаданиеГрупповойОбработки();
			ПодключитьОбработчикОжидания("ПроверкаАктивностиФоновогоЗаданияКлиент", 2, Истина);			
		КонецЕсли;
		
	Иначе
		
		ОбновитьНаСервере();
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УправлениеЭлементамиФормы() Экспорт 			
	
	// фоновые процессы
	Элементы.ИндикаторПроцесса.Заголовок = "Индикатор процесса";
	Элементы.ИндикаторПроцесса.Видимость = ЗначениеЗаполнено(ЭтаФорма.КлючФоновогоЗадания);
	ЭтаФорма.Доступность = НЕ ЗначениеЗаполнено(ЭтаФорма.КлючФоновогоЗадания);	
	
КонецПроцедуры

