
&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭтаФорма.ТолькоПросмотр = Объект.Предопределенный;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТипОбработчикаПриИзменении(Элемент)
	
	Если Объект.ТипОбработчика = ПредопределенноеЗначение("Перечисление.ТипыОбработчиков.ОбработчикSQL") Тогда
		Объект.КонтекстИсполнения = ПредопределенноеЗначение("Перечисление.КонтекстыИсполненияОбработчиков.КонтекстВнешнегоПодключения");
	КонецЕсли;
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УправлениеДоступностьюЭлементовФормы()
	
	Элементы.КонтекстИсполнения.Доступность = (Объект.ТипОбработчика = ПредопределенноеЗначение("Перечисление.ТипыОбработчиков.Обработчик1СПредприятие"));
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)	
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры
