
&НаКлиенте
//
//
Процедура Отмена(Команда)
	ЗакрытьФорму(СформироватьПараметры());
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОК(Команда)
	ОбработатьВыбор();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗакрытьФорму(ПараметрыЗаполнения)
	ЭтаФорма.Закрыть(ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
//
//
Функция СформироватьПараметры()
	ПараметрыЗаполнения = Новый Структура;		
	ПараметрыЗаполнения.Вставить("Выбран", Ложь);
	ПараметрыЗаполнения.Вставить("Имя", 0);
	ПараметрыЗаполнения.Вставить("ИнформационнаяБаза", ПредопределенноеЗначение("Справочник.ИнформационныеБазы.ПустаяСсылка"));	
	ПараметрыЗаполнения.Вставить("ИмяСтарое", "");	
	Возврат ПараметрыЗаполнения;
КонецФункции

&НаКлиенте
//
//
Процедура ДоступныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыбор();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОбработатьВыбор()
	ПараметрыЗаполнения = СформироватьПараметры();
	ПараметрыЗаполнения.Выбран = Истина;
	ПараметрыЗаполнения.Имя = Элементы.ДоступныеПользователи.ТекущиеДанные.Имя;
	ПараметрыЗаполнения.ИнформационнаяБаза = Элементы.ДоступныеПользователи.ТекущиеДанные.ИнформационнаяБаза;	
	ПараметрыЗаполнения.ИмяСтарое = Элементы.ДоступныеПользователи.ТекущиеДанные.ИмяСтарое;
	ЗакрытьФорму(ПараметрыЗаполнения);
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЭтаФорма.ДоступныеПользователи.Загрузить(ПолучитьИзВременногоХранилища(ЭтаФорма.Параметры.АдресТаблицыДоступныхПользователей));
	УдалитьИзВременногоХранилища(ЭтаФорма.Параметры.АдресТаблицыДоступныхПользователей);
КонецПроцедуры

