
&НаКлиенте
//
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
	ДиалогВыбораКаталога.ПолноеИмяФайла = СокрЛП(ПараметрКоманды);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл сохранения";
	Фильтр = "(*.xml)|*.xml";
	ДиалогВыбораКаталога.Фильтр = Фильтр;	
	Если ДиалогВыбораКаталога.Выбрать() Тогда		
		
		Если ОбработкаКомандыСервер(ПараметрКоманды, ДиалогВыбораКаталога.ПолноеИмяФайла) Тогда
			ПоказатьПредупреждение(, "Данные успешно сохранены.");
		Иначе 
			ПоказатьПредупреждение(, "Ошибка при выполнении операции!" + Символы.ПС + "Подробное описание ошибки записано в журнал регистрации");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
//
//
Функция ОбработкаКомандыСервер(ПараметрКоманды, ПолноеИмяФайла)
	Возврат Справочники.Обработчики.СохранитьВФайл(ПараметрКоманды, ПолноеИмяФайла);
КонецФункции
