
// Общий модуль
//

&НаСервере
//
//
Функция ПрефиксИсполненияКомандыНаСервере() Экспорт
	Возврат "#ServerExec#";
КонецФункции

&НаСервере
//
//
Функция ПрефиксСообщенияЗначенияПрогресса() Экспорт
	Возврат "#ProgValue#";
КонецФункции

&НаСервере
//
//
Функция РазделительЗначенийСообщения() Экспорт
	Возврат "#Sep#";
КонецФункции


&НаСервере
//
//
Функция НайтиФоновыйПроцессПоКлючу(Ключ) Экспорт
	ФоновыйПроцесс = Неопределено;
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", Ключ));
	Если МассивФоновыхЗаданий.Количество() > 0 И ЗначениеЗаполнено(Ключ) Тогда
		ФоновыйПроцесс = МассивФоновыхЗаданий[0];	
	КонецЕсли;
	Возврат ФоновыйПроцесс;
КонецФункции

&НаСервере
//
//
Функция ЗавершитьФоновыйПроцессПоКлючу(Ключ) Экспорт
	Результат = Истина;
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", Ключ));
	Если МассивФоновыхЗаданий.Количество() > 0 И ЗначениеЗаполнено(Ключ) Тогда
		Попытка
			МассивФоновыхЗаданий[0].Отменить();	
		Исключение
			Результат = Ложь;
		КонецПопытки;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ПолучитьСообщенияФоновогоПроцесса(ФоновыйПроцесс) Экспорт
	МассивСообщенийПроцесса = Новый Массив;
	ФиксированныйМассив = ФоновыйПроцесс.ПолучитьСообщенияПользователю(Истина);
	Если ФиксированныйМассив <> Неопределено Тогда 
		Для Каждого Сообщение Из ФиксированныйМассив Цикл												
			МассивСообщенийПроцесса.Добавить(Сообщение);				
		КонецЦикла; 			
	КонецЕсли;
	Возврат МассивСообщенийПроцесса;
КонецФункции

&НаСервере
//
//
Функция ОбработатьАварийноеЗавершение(ФоновыйПроцесс, МассивСообщений = Неопределено) Экспорт
	Результат = НЕ (ФоновыйПроцесс.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно);
	Если МассивСообщений = Неопределено Тогда МассивСообщений = ПолучитьСообщенияФоновогоПроцесса(ФоновыйПроцесс); КонецЕсли;
	Если НЕ Результат Тогда
		Для Каждого ЭлементМассива Из МассивСообщений Цикл
			СообщениеПолзователю = Новый СообщениеПользователю;
			СообщениеПолзователю.Текст = "Ошибка фонового процесса: " + ЭлементМассива; 
			СообщениеПолзователю.Сообщить();		
		КонецЦикла;		
		Если ФоновыйПроцесс.ИнформацияОбОшибке <> Неопределено Тогда 
			СообщениеПолзователю = Новый СообщениеПользователю;
			СообщениеПолзователю.Текст = "Ошибка фонового процесса: " + ФоновыйПроцесс.ИнформацияОбОшибке.Описание; 
			СообщениеПолзователю.Сообщить();
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ПроверкаАктивностиФоновогоЗаданияСервер(Ключ) Экспорт
	
	Результат = Новый Массив;
	
	ШаблонОтвета = Новый ФиксированнаяСтруктура("Активно, ОбновленаИнформацияИндикатора, ИнформацияИндикатора, Команда", 
									Ложь, Ложь, Новый Структура("Значение, Текст", 0, ""), "");	
	
	ФоновыйПроцесс = ФоновыеПроцессыМенеджерСервер.НайтиФоновыйПроцессПоКлючу(Ключ);
		
	Если ФоновыйПроцесс <> Неопределено Тогда 	 
		
		МассивСообщенийПользователю = Новый Массив;
		МассивСообщенийПроцесса = ФоновыеПроцессыМенеджерСервер.ПолучитьСообщенияФоновогоПроцесса(ФоновыйПроцесс);				
		Для Каждого Сообщение Из МассивСообщенийПроцесса Цикл			
			Если Лев(Сообщение.Текст, СтрДлина(ФоновыеПроцессыМенеджерСервер.ПрефиксСообщенияЗначенияПрогресса())) = ФоновыеПроцессыМенеджерСервер.ПрефиксСообщенияЗначенияПрогресса() Тогда					
				
				ТекущееЗначениеОтвета = Новый Структура(ШаблонОтвета);
				
				ТекущееЗначениеОтвета.Активно = (ФоновыйПроцесс.Состояние = СостояниеФоновогоЗадания.Активно);
				ТекущееЗначениеОтвета.ОбновленаИнформацияИндикатора = Истина;
				МассивЗначений = ОбщегоНазначенияСервер.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(Сообщение.Текст, ФоновыеПроцессыМенеджерСервер.ПрефиксСообщенияЗначенияПрогресса(), ""), ФоновыеПроцессыМенеджерСервер.РазделительЗначенийСообщения()); 
				ТекущееЗначениеОтвета.ИнформацияИндикатора.Значение = МассивЗначений[0];
				ТекущееЗначениеОтвета.ИнформацияИндикатора.Текст = МассивЗначений[1];
				ТекущееЗначениеОтвета.Команда = МассивЗначений[2];
				
				Результат.Добавить(ТекущееЗначениеОтвета);
				
			Иначе				
				
				МассивСообщенийПользователю.Добавить(Сообщение);
				
			КонецЕсли;
		КонецЦикла; 
				
		Если НЕ ФоновыеПроцессыМенеджерСервер.ОбработатьАварийноеЗавершение(ФоновыйПроцесс, МассивСообщенийПользователю) Тогда
			ТекущееЗначениеОтвета = Новый Структура(ШаблонОтвета);
			
			ТекущееЗначениеОтвета.Активно = Ложь;
			ТекущееЗначениеОтвета.ОбновленаИнформацияИндикатора = Истина;
			ТекущееЗначениеОтвета.ИнформацияИндикатора.Значение = 0;
			ТекущееЗначениеОтвета.ИнформацияИндикатора.Текст = "";
			ТекущееЗначениеОтвета.Команда = "Объект.КлючФоновогоЗадания = """";";
			
			Результат.Добавить(ТекущееЗначениеОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ОтправитьСообщениеФоновогоПроцесса(Значение = 0, Текст = "", Команда = "Если Истина Тогда КонецЕсли;", ПрефиксСообщения = Неопределено) Экспорт
	Если ПрефиксСообщения = Неопределено Тогда ПрефиксСообщения = ФоновыеПроцессыМенеджерСервер.ПрефиксСообщенияЗначенияПрогресса(); КонецЕсли;
	СообщениеПолзователю = Новый СообщениеПользователю;
	СообщениеПолзователю.Текст = ПрефиксСообщения + СокрЛП(Значение) + ФоновыеПроцессыМенеджерСервер.РазделительЗначенийСообщения() + СокрЛП(Текст) + ФоновыеПроцессыМенеджерСервер.РазделительЗначенийСообщения() + Команда; 
	СообщениеПолзователю.Сообщить();
КонецФункции

&НаСервере
//
//
Функция ОпределитьВыполнитьКомандуНаСервере(Команда) Экспорт
	Возврат (Лев(Команда, СтрДлина(ФоновыеПроцессыМенеджерСервер.ПрефиксИсполненияКомандыНаСервере())) = ФоновыеПроцессыМенеджерСервер.ПрефиксИсполненияКомандыНаСервере());
КонецФункции
