
//
//
Функция ОбработкаОповещенийССервера() Экспорт
	
	МассивСообщений = ОбработкаОповещенийССервераСервер.ПолучитьСообщенияССервера();
	
	Для Каждого ТекущееСообщениеМассивСообщений Из МассивСообщений Цикл 
		
		Если ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.КомандаОткрытияВРежимеПредприятия") Тогда
			ЗадачиНаКлиенте.КомандаЗапуститьПредприятие(Неопределено, ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ИнформационныеБазыОбновитьФормаСписка") Тогда
			Оповестить("ИнформационныеБазы.Обновить.ФормаСписка");
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВывестиСообщение") Тогда
			Сообщить(ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВывестиТекстовуюИнформацию") Тогда			
			ЗадачиНаКлиенте.ПоказатьТекстовуюИнформацию("Информация", ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВыполнитьКоманду") Тогда			
			Выполнить(ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		КонецЕсли;		
		
	КонецЦикла;
	
КонецФункции