
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборКомпоновкиДанных = Неопределено;
	Если Параметры.Свойство("ОтборКомпоновкиДанных", ОтборКомпоновкиДанных) Тогда
		
		Для Каждого ЭлементОтборКомпоновкиДанных Из ОтборКомпоновкиДанных.Элементы Цикл			
			НовыйЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(ТипЗнч(ЭлементОтборКомпоновкиДанных));
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтборКомпоновкиДанных);
			//НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			//НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			//НовыйЭлементОтбора.ПравоеЗначение = МассивОтбораПоСсылке;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
