
&НаКлиенте
//
//
Процедура СократитьАрхив(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();	
	Диалог.Период = Новый СтандартныйПериод;
	Если Диалог.Редактировать() Тогда 
    	СократитьАрхивНаСервере(Диалог.Период);
		ЭтаФорма.ОбновитьОтображениеДанных();		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
//
//
Процедура СократитьАрхивНаСервере(ВыбранныйПериод)
	
	ДатаНачала = ВыбранныйПериод.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(ВыбранныйПериод.ДатаОкончания), ВыбранныйПериод.ДатаОкончания, ДобавитьМесяц(ТекущаяДатаСеанса(), 100));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеАрхивов.ДатаСобытия,
		|	ХранилищеАрхивов.ИнформационнаяБаза
		|ИЗ
		|	РегистрСведений.ХранилищеАрхивов КАК ХранилищеАрхивов
		|ГДЕ
		|	НЕ(ХранилищеАрхивов.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|
		|ДЛЯ ИЗМЕНЕНИЯ";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	НаборЗаписей = РегистрыСведений.ХранилищеАрхивов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
		
КонецПроцедуры