
&НаКлиенте
//
//
Процедура НастройкаОбщихПараметровСистемыНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкаПараметровСистемы");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ДобавитьУчетныеЗаписиНажатие(Элемент)
	ОткрытьФорму("Справочник.УчетныеЗаписи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ДобавляемНастройкиСерверовНажатие(Элемент)
	ОткрытьФорму("Справочник.Сервера.ФормаСписка");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ДобавитьВидыКонфигурацийНажатие(Элемент)
	ОткрытьФорму("Справочник.ВидыКонфигураций.ФормаСписка");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ИмпортИзСпискаБазНажатие(Элемент)
	ОткрытьФорму("Обработка.ИмпортДанныхИзСпискаБаз.Форма");
КонецПроцедуры

&НаКлиенте
//
//
Процедура РучнаяНастройкаНажатие(Элемент)
	ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ИмпортРелизовОбновленийНажатие(Элемент)
	ОткрытьФорму("Обработка.ИмпортРелизовОбновлений.Форма");
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗагрузкаОбновленийНажатие(Элемент)
	ОткрытьФорму("Обработка.ЗагрузкаОбновлений.Форма");
КонецПроцедуры

&НаКлиенте
//
//
Процедура РучноеДобавлениеНажатие(Элемент)
	ОткрытьФорму("Справочник.РелизыОбновлений.ФормаСписка");
КонецПроцедуры
