
//
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ПортКластера");
	Поля.Добавить("Комментарий");
КонецПроцедуры

//
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ПостфиксПортКластера = ":" + Формат(Данные.ПортКластера, "ЧГ=0");
	КоличествоСимволовКомментария = 50;
	ПредставлениеКомментарий = СокрЛП(Данные.Комментарий);
	Если ЗначениеЗаполнено(ПредставлениеКомментарий) Тогда
		ПредставлениеКомментарий = " (" + ПредставлениеКомментарий + ?(СтрДлина(ПредставлениеКомментарий) > КоличествоСимволовКомментария, "...", "")  + ")";
	КонецЕсли;
	Представление = СокрЛП(Данные.Наименование);
	Представление = Представление + ?(СтрЧислоВхождений(Представление, ПостфиксПортКластера) = 0, ПостфиксПортКластера, "") + ПредставлениеКомментарий;
КонецПроцедуры
