
Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ТипСервера = Перечисления.ТипыСерверов.Сервер1С Тогда 
		ПараметрыПодключения = ЗадачиНаСервере.ПолучитьПараметрыИзСтрокиПодключенияКСерверу(ЭтотОбъект.Наименование);
		ЭтотОбъект.Наименование = ПараметрыПодключения.ИмяСервера;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ПортКластера) Тогда
			ЭтотОбъект.ПортКластера = ПараметрыПодключения.ПортКластера;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ПортСервера) Тогда
			ЭтотОбъект.ПортСервера = ПараметрыПодключения.ПортСервера;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПортСервераАдминистрирования) Тогда
		ЭтотОбъект.ПортСервераАдминистрирования = 1545;
	КонецЕсли;
КонецПроцедуры
