
&НаКлиенте
//
//
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог платформы";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.Каталог;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		
		ТекущийКаталог = СокрЛП(ДиалогВыбораКаталога.Каталог);
		ТекущийКаталог = ?(Прав(ТекущийКаталог, 1) = "\", ТекущийКаталог, ТекущийКаталог + "\");
		ИсполняемыйФайлПлатформы = Новый Файл(ТекущийКаталог + ЗадачиНаСервере.ПолучитьИмяИсполняемогоФайлаПлатформы());
		
		Если ИсполняемыйФайлПлатформы.Существует() Тогда 
			
			ЭтаФорма.Объект.Каталог = ТекущийКаталог;		
			ЭтаФорма.ОбновитьОтображениеДанных();
			ЭтаФорма.Модифицированность = Истина;
		
			КаталогНачалоВыбораНаСервере();
			
		Иначе
			
			ОбщегоНазначенияСервер.ВывестиСообщение("В указанном каталоге не найден исполняемый файл платформы " + ЗадачиНаСервере.ПолучитьИмяИсполняемогоФайлаПлатформы());
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
//
//
Процедура КаталогНачалоВыбораНаСервере()
	
	ЭтаФорма.Объект.Наименование = Справочники.РелизыТехнологическойПлатформы.ВыделитьНомерРелизаИзКаталогаПлатформы(ЭтаФорма.Объект.Каталог);
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Наименование) Тогда
		ЭтаФорма.Объект.ТипCOMСоединителя = Справочники.РелизыТехнологическойПлатформы.ОпределитьТипCOMСоединителяПоНомеруПлатформы(ЭтаФорма.Объект.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.Каталог);
КонецПроцедуры

