
&НаКлиенте
//
//
Процедура AdditionalParametersНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ОткрытьФорму("Справочник.ЭлементыСписковИнформационныхБаз.Форма.ФормаУстановкиДополнительныхПараметровЗапуска", Новый Структура("AdditionalParameters", Объект.AdditionalParameters), ЭтаФорма,,,,
	Новый ОписаниеОповещения("AdditionalParametersНачалоВыбораОписаниеОповещения", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура AdditionalParametersНачалоВыбораОписаниеОповещения(РезультатОповещения, ПараметрыОповещения) Экспорт

	Если РезультатОповещения <> Неопределено Тогда
		Объект.AdditionalParameters = РезультатОповещения;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
//
//
Процедура ИнформационнаяБазаПриИзменении(Элемент)
	ИнформационнаяБазаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
//
//
Процедура ИнформационнаяБазаПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(Объект.ИнформационнаяБаза.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры
