
&НаСервере
//
//
Процедура ЗагрузитьПравилаНаСервере(АдресВременногоХранилища)
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ХранилищеДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилища), Новый СжатиеДанных(9));
	ТекущийОбъект.Записать();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗагрузитьПравила(Команда)	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл загрузки";
	Фильтр = "(*.xml)|*.xml";
	ДиалогВыбораКаталога.Фильтр = Фильтр;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогВыбораКаталога.ПолноеИмяФайла), Новый УникальныйИдентификатор);
		Если ПрочитатьПараметрыПравил(АдресВременногоХранилища) Тогда
			ЭтаФорма.Записать();
			ЗагрузитьПравилаНаСервере(АдресВременногоХранилища);
		Иначе
			ОписаниеОшибки = "Выбранных файл не содержит правил объединения, либо произошли ошибки при считывании содержимого файла!";
			Если НЕ ЗначениеЗаполнено(Объект.ОсновнаяКонфигурация) Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "В справочнике релизов обновления не определено соответствие для основной конифгурации объединения.";
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ВтораяКонфигурация) Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "В справочнике релизов обновления не определено соответствие для второй конифгурации объединения.";
			КонецЕсли;
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;	
	УправлениеДоступностьюЭлементовФормы();
КонецПроцедуры

&НаСервере
//
//
Функция ПрочитатьПараметрыПравил(АдресВременногоХранилища)
	Результат = Истина;
	СтруктуруПараметровФайлаОбъединения = Справочники.ПравилаОбъединения.ПрочитатьПараметрыФайлаПравилОбъединения(ПолучитьИзВременногоХранилища(АдресВременногоХранилища));
	Объект.ОсновнаяКонфигурация = СтруктуруПараметровФайлаОбъединения.MainConfiguration.РелизОбновления;
	Объект.ВтораяКонфигурация = СтруктуруПараметровФайлаОбъединения.SecondConfiguration.РелизОбновления;
	Объект.Описание = "" + СтруктуруПараметровФайлаОбъединения.MainConfiguration.Name + "[" + СтруктуруПараметровФайлаОбъединения.MainConfiguration.Version + "] {MERGE} "	
	+ СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Name + "[" + СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Version + "]";
	Результат = (ЗначениеЗаполнено(Объект.ОсновнаяКонфигурация) И ЗначениеЗаполнено(Объект.ВтораяКонфигурация));
	Возврат Результат;
КонецФункции

&НаКлиенте
//
//
Процедура УправлениеДоступностьюЭлементовФормы()
	
	ЭтаФорма.Заголовок = Объект.Описание;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностьюЭлементовФормы();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Объект.Описание;
КонецПроцедуры

