
//
//
Функция ПолучитьСтруктуруПараметровФайлаПравилОбъединения() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("MainConfiguration", Новый Структура("Name, Version, РелизОбновления", "", "", Справочники.РелизыОбновлений.ПустаяСсылка()));
	Результат.Вставить("SecondConfiguration", Новый Структура("Name, Version, РелизОбновления", "", "", Справочники.РелизыОбновлений.ПустаяСсылка()));
	Возврат Результат;
КонецФункции

//
//
Функция ПрочитатьПараметрыФайлаПравилОбъединения(Источник, СтруктуруПараметровФайлаОбъединения = Неопределено) Экспорт
	
	Если СтруктуруПараметровФайлаОбъединения = Неопределено Тогда 
		СтруктуруПараметровФайлаОбъединения = ПолучитьСтруктуруПараметровФайлаПравилОбъединения();
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		
		ФайлПравилОбъединения = Новый ТекстовыйДокумент;
		ФайлПравилОбъединения.Прочитать(Источник);
		ДанныеXML = ФайлПравилОбъединения.ПолучитьТекст();
		
		ДанныеXMLMainConfiguration = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXML, "MainConfiguration");
		ДанныеXMLSecondConfiguration = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXML, "SecondConfiguration");
		
		СтруктуруПараметровФайлаОбъединения.MainConfiguration.Name = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXMLMainConfiguration, "Name");
		СтруктуруПараметровФайлаОбъединения.MainConfiguration.Version = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXMLMainConfiguration, "Version");
		СтруктуруПараметровФайлаОбъединения.MainConfiguration.РелизОбновления =  ПолучитьРелизОбновленияПоПараметрам(СтруктуруПараметровФайлаОбъединения.MainConfiguration.Version, СтруктуруПараметровФайлаОбъединения.MainConfiguration.Name);
		
		СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Name = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXMLSecondConfiguration, "Name");
		СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Version = ОбщегоНазначенияСервер.ПолучитьНаборДанныхПоТегуXML(ДанныеXMLSecondConfiguration, "Version");
		СтруктуруПараметровФайлаОбъединения.SecondConfiguration.РелизОбновления =  ПолучитьРелизОбновленияПоПараметрам(СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Version, СтруктуруПараметровФайлаОбъединения.SecondConfiguration.Name);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДвоичныеДанные") Тогда
		
		КаталогСохранения = ЗаписатьПравилаОбновленияВоВременныйФайл(Источник);
		
		СтруктуруПараметровФайлаОбъединения = ПрочитатьПараметрыФайлаПравилОбъединения(КаталогСохранения, СтруктуруПараметровФайлаОбъединения); 
		
		Попытка
			УдалитьФайлы(КаталогСохранения);
		Исключение			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СтруктуруПараметровФайлаОбъединения;
КонецФункции

//
//
Функция ЗаписатьПравилаОбновленияВоВременныйФайл(ДвоичныеДанные) Экспорт
	//КаталогСохранения = КаталогВременныхФайлов();
	//КаталогСохранения = КаталогСохранения + ?(Прав(КаталогСохранения, 1) = "\", "", "\") + СокрЛП(Новый УникальныйИдентификатор) + ".xml";
	КаталогСохранения = ОбщегоНазначенияСервер.ПолучитьПолноеИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(КаталогСохранения);
	Возврат КаталогСохранения;
КонецФункции

//
//
Функция ПолучитьРелизОбновленияПоПараметрам(НомерРелиза, ИмяВидаКонфгурации) Экспорт
	
	Результат = Справочники.РелизыОбновлений.ПустаяСсылка();
	
	ВидКонфигурации = Справочники.ВидыКонфигураций.НайтиПоНаименованию(ИмяВидаКонфгурации);
	Если НЕ ВидКонфигурации = Справочники.ВидыКонфигураций.ПустаяСсылка() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизыОбновлений.Ссылка
		|ИЗ
		|	Справочник.РелизыОбновлений КАК РелизыОбновлений
		|ГДЕ
		|	ВЫРАЗИТЬ(РелизыОбновлений.Наименование КАК СТРОКА(500)) = ВЫРАЗИТЬ(&Наименование КАК СТРОКА(500))
		|	И РелизыОбновлений.ВидКонфигурации = &ВидКонфигурации";
		
		Запрос.УстановитьПараметр("ВидКонфигурации", ВидКонфигурации);
		Запрос.УстановитьПараметр("Наименование", НомерРелиза);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат
КонецФункции