
&НаСервере
//
//
Функция ЗаполнитьЗначенияРезультатаВыбораПараметровОбработки(ОбъектОбработки, МассивПараметрыОбработки) Экспорт
	
	ТекущийВидГрупповойОбработки = Неопределено;
	РежимСценария = Ложь;
	
	Результат = Истина;
	Для Каждого ТекущийЭлементМассивПараметрыОбработки Из МассивПараметрыОбработки Цикл
		
		ЗаполнитьЗначенияСвойств(ОбъектОбработки, ТекущийЭлементМассивПараметрыОбработки);
		
		НоваяСтрокаОбъектСписок = ОбъектОбработки.Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОбъектСписок, ТекущийЭлементМассивПараметрыОбработки);
		НоваяСтрокаОбъектСписок.ВидКонфигурации = ТекущийЭлементМассивПараметрыОбработки.ИнформационнаяБаза.ВидКонфигурации;
		НоваяСтрокаОбъектСписок.РелизОбновления = ТекущийЭлементМассивПараметрыОбработки.ИнформационнаяБаза.РелизОбновления;
		
	КонецЦикла;
	
	ИсходнаяТаблица = ОбъектОбработки.Список.Выгрузить();		
	ИсходнаяТаблица.Свернуть("ВидОбработки");
	ОбъектОбработки.РежимСценария = (ИсходнаяТаблица.Количество() > 1);	
	ИсходнаяТаблица = Неопределено;
	
	ИсходнаяТаблица = ОбъектОбработки.Список.Выгрузить();
	ВременнаяТаблица = ИсходнаяТаблица.Скопировать();
	ВременнаяТаблица.Свернуть("ИнформационнаяБаза");	
	ОбъектОбработки.РазрешатьМножественныйПодборОдногоЭлемента = НЕ (ВременнаяТаблица.Количество() = ИсходнаяТаблица.Количество());
	ВременнаяТаблица = Неопределено;	
	ИсходнаяТаблица = Неопределено;
	
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция СформироватьРезультатВыбораПараметровОбработки(ОбъектОбработки) Экспорт
	
	Результат = Неопределено;
	
	Если ОбъектОбработки.Список.Количество() > 0 Тогда
		
		Результат = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из ОбъектОбработки.Список Цикл

			ПараметрыОбработки = ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(СтрокаТаблицы.ИнформационнаяБаза);	
			ПараметрыОбработки.Вставить("Обрабатывать", Ложь);
			ПараметрыОбработки.Вставить("УстановитьРелизОбновления", Справочники.РелизыОбновлений.ПустаяСсылка());
			ПараметрыОбработки.Вставить("КоличествоПараллельныхПроцессов", 1);
			ПараметрыОбработки.Вставить("КоличествоПараллельныхПроцессов", 1);
			ПараметрыОбработки.Вставить("АвтоОпределениеУстанавливаемогоРелизаОбновления", Ложь);			
			
			ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ОбъектОбработки);
			ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаТаблицы);
			
			Результат.Добавить(ПараметрыОбработки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции