&НаКлиенте
//
//
Процедура УстановитьФлажки(Таблица, Поле, Флаг)
	Для Каждого ТекущаяСтрока Из Таблица Цикл
		ТекущаяСтрока[Поле] = Флаг;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОтборПоСобытиямВыделитьВсе(Команда)
	УстановитьФлажки(Отчет.СобытияЖурнала, "Обрабатывать", Истина);
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОтборПоСобытиямУбратьВсе(Команда)
	УстановитьФлажки(Отчет.СобытияЖурнала, "Обрабатывать", Ложь);
КонецПроцедуры

&НаКлиенте
//
//
Процедура КонецПериодаПриИзменении(Элемент)
	ПроверитьКорректностьПериода();
КонецПроцедуры

&НаКлиенте
//
//
Процедура НачалоПериодаПриИзменении(Элемент)
	ПроверитьКорректностьПериода();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПроверитьКорректностьПериода()
	Если Отчет.КонецПериода < Отчет.НачалоПериода Тогда
		лНачалоПериода = Отчет.НачалоПериода;
		Отчет.НачалоПериода = Отчет.КонецПериода;
		Отчет.КонецПериода = лНачалоПериода;
	КонецЕсли;
	Отчет.ТаблицаДанных.Очистить();	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗаполнитьТаблицуДанных(Команда)
	
	Если Отчет.ТаблицаДанных.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуДанныхОписаниеОповещенияПерезаполнятьТаблицу", ЭтаФорма), "Перезаполнить таблицу данных", РежимДиалогаВопрос.ДаНет);
		
	Иначе 
		
		ЗаполнитьТаблицуДанныхОписаниеОповещенияПерезаполнятьТаблицу(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗаполнитьТаблицуДанныхОписаниеОповещенияПерезаполнятьТаблицу(РезультатОповещения, ПараметрыОповещения) Экспорт
	
	ПерезаполнятьТаблицуДанных = Истина;
	
	Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
		ПерезаполнятьТаблицуДанных = Ложь;
	КонецЕсли;
	
	ЗаполнитьТаблицуДанныхНаСервере(ПерезаполнятьТаблицуДанных);
	
КонецПроцедуры

&НаСервере
//
//
Процедура ЗаполнитьТаблицуДанныхНаСервере(ПерезаполнятьТаблицуДанных)
	ТекущийОбъект = РеквизитФормыВЗначение("Отчет");
	ТекущийОбъект.СформироватьВнешниеНаборыДанных(ПерезаполнятьТаблицуДанных);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Отчет");
КонецПроцедуры

&НаКлиенте
//
//
Процедура СформироватьОтчет(Команда)
	ЗаполнитьТаблицуДанных(Команда);
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
//
//
Процедура СформироватьОтчетНаСервере()
	СписокВнешнихБаз = Неопределено;
	ТекущийОбъект = РеквизитФормыВЗначение("Отчет");
	ТекущийОбъект.СформироватьОтчет(Результат, ДанныеРасшифровки, Истина);	
	Результат.ПоказатьУровеньГруппировокСтрок(1);
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчет;
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.НачалоПериода = НачалоДня(ТекущаяДатаСеанса());
	Отчет.КонецПериода = КонецДня(ТекущаяДатаСеанса());
КонецПроцедуры