
&НаКлиенте
//
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл загрузки";
	Фильтр = "(*.xml)|*.xml";
	ДиалогВыбораКаталога.Фильтр = Фильтр;	
	Если ДиалогВыбораКаталога.Выбрать() Тогда				
		
		Если ОбработкаКомандыСервер(ПараметрКоманды, ДиалогВыбораКаталога.ПолноеИмяФайла, НЕ ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Обработчики.Форма.ФормаЭлемента") Тогда
			ПоказатьПредупреждение(, "Данные успешно загружены.");
		Иначе 
			ПоказатьПредупреждение(, "Ошибка при выполнении операции!" + Символы.ПС + "Подробное описание ошибки записано в журнал регистрации");
		КонецЕсли;
		
		ПараметрыВыполненияКоманды.Источник.Прочитать();
		
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
//
//
Функция ОбработкаКомандыСервер(ПараметрКоманды, ПолноеИмяФайла, СоздаватьНовый)
	Возврат Справочники.Обработчики.ЗагрузитьИзФайла(ПараметрКоманды, ПолноеИмяФайла, СоздаватьНовый);
КонецФункции
