
&НаКлиенте
//
//
Процедура СформироватьРезультат()	
	Результат = НРег(Результат);
	Результат = СтрЗаменить(Результат, НРег("/AppAutoCheckMode"), "");
	Если AppAutoCheckMode Тогда
		Результат = Результат + " /AppAutoCheckMode";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/AppAutoCheckVersion"), "");
	Если AppAutoCheckVersion Тогда
		Результат = Результат + " /AppAutoCheckVersion";	
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/AU-"), "");
	Результат = СтрЗаменить(Результат, НРег("/AU+"), "");
	Если ЗначениеЗаполнено(AU) Тогда
		Результат = Результат + " " + AU;
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/ClearCache"), "");
	Если ClearCache Тогда
		Результат = Результат + " /ClearCache";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/DisableStartupMessages"), "");
	Если DisableStartupMessages Тогда
		Результат = Результат + " /DisableStartupMessages";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/RunModeManagedApplication"), "");
	Если RunModeManagedApplication Тогда
		Результат = Результат + " /RunModeManagedApplication";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/RunModeOrdinaryApplication"), "");
	Если RunModeOrdinaryApplication Тогда
		Результат = Результат + " /RunModeOrdinaryApplication";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/UseHwLicenses-"), "");
	Результат = СтрЗаменить(Результат, НРег("/UseHwLicenses+"), "");
	Если ЗначениеЗаполнено(UseHwLicenses) Тогда
		Результат = Результат + " " + UseHwLicenses;
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, НРег("/WA-"), "");
	Результат = СтрЗаменить(Результат, НРег("/WA+"), "");
	Если ЗначениеЗаполнено(WA) Тогда
		Результат = Результат + " " + WA;
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, "/", " /");
	
КонецПроцедуры

&НаСервере
//
//
Процедура РаспарситьРезультат()
	Если СтрЧислоВхождений(НРег(Результат), НРег("/AppAutoCheckMode")) > 0 Тогда
		AppAutoCheckMode = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/AppAutoCheckVersion")) > 0 Тогда
		AppAutoCheckVersion = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/AU-")) > 0 Тогда
		AU = "/AU-";
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/AU+")) > 0 Тогда
		AU = "/AU+";
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/ClearCache")) > 0 Тогда
		ClearCache = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/DisableStartupMessages")) > 0 Тогда
		DisableStartupMessages = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/RunModeManagedApplication")) > 0 Тогда
		RunModeManagedApplication = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/RunModeOrdinaryApplication")) > 0 Тогда
		RunModeOrdinaryApplication = Истина;
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/UseHwLicenses-")) > 0 Тогда
		UseHwLicenses = "/UseHwLicenses-";
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/UseHwLicenses+")) > 0 Тогда
		UseHwLicenses = "/UseHwLicenses+";
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/WA-")) > 0 Тогда		
		WA = "/WA-";
	КонецЕсли;
	Если СтрЧислоВхождений(НРег(Результат), НРег("/WA+")) > 0 Тогда
		WA = "/WA+";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗначениеПриИзменении(Элемент)
	СформироватьРезультат();
КонецПроцедуры


&НаКлиенте
//
//
Процедура ОК(Команда)
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Результат = ЭтаФорма.Параметры.AdditionalParameters;
	РаспарситьРезультат();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

