
//
//
Функция Прочитать_UpdInfo(Каталог) Экспорт 
	Результат = Новый Структура;	
	//Version
	//FromVersions
	//UpdateDate
	Если ЗначениеЗаполнено(Каталог) Тогда
		ИмяФайла = "UpdInfo.txt";
		ПолноИмяФайла = Каталог  + "\" + ИмяФайла;
		Файл_UpdInfo = Новый Файл(ПолноИмяФайла);
		Если Файл_UpdInfo.Существует() Тогда 
			ЧтениеТекста = Новый ЧтениеТекста(ПолноИмяФайла);
			//ТекущаяСтрока = ЧтениеТекста.ПрочитатьСтроку();
			//Пока ТекущаяСтрока <> Неопределено Цикл
			//	ТекущийТэг = Лев(ТекущаяСтрока, Найти(ТекущаяСтрока, "=") -1);
			//	Если ЗначениеЗаполнено(ТекущийТэг) Тогда
			//		Результат.Вставить(ТекущийТэг, СокрЛП(СтрЗаменить(ТекущаяСтрока, ТекущийТэг + "=", ""))); 
			//	КонецЕсли;
			//	ТекущаяСтрока = ЧтениеТекста.ПрочитатьСтроку();
			//КонецЦикла;
			
			МассивСтрок = ОбщегоНазначенияСервер.РазложитьСтрокуВМассивПодстрок(ЧтениеТекста.Прочитать(), Символы.ПС);
			Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
				МассивПараметров = ОбщегоНазначенияСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "=");
				Если МассивПараметров.Количество() > 1 Тогда
					Значение = "";
					НомерТекущегоЗначения = 0;
					Для Каждого ТекущееЗначение Из МассивПараметров Цикл 
						НомерТекущегоЗначения = НомерТекущегоЗначения + 1;
						Если НомерТекущегоЗначения = 1 Тогда Продолжить; КонецЕсли;
						Значение = Значение + ?(ЗначениеЗаполнено(Значение), "=", "") + ТекущееЗначение;						
					КонецЦикла;
					Результат.Вставить(СокрЛП(МассивПараметров[0]), Значение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	Возврат Результат
КонецФункции

//
//
Функция Прочитать_1cv8_mft(Каталог) Экспорт 
	Результат = Новый Структура;
	// Vendor
	// Name
	// Version
	// AppVersion
	Если ЗначениеЗаполнено(Каталог) Тогда
		ИмяФайла = "1cv8.mft";	
		ПолноИмяФайла = Каталог  + ?(Прав(Каталог, СтрДлина(ИмяФайла)) = ИмяФайла, "", ?(Прав(Каталог, 1) = "\", "", "\") + ИмяФайла);
		Файл_UpdInfo = Новый Файл(ПолноИмяФайла);
		Если Файл_UpdInfo.Существует() Тогда 
			ЧтениеТекста = Новый ЧтениеТекста(ПолноИмяФайла);
			ТекущаяСтрока = ЧтениеТекста.ПрочитатьСтроку();
			Пока ТекущаяСтрока <> Неопределено Цикл
				ТекущийТэг = Лев(ТекущаяСтрока, Найти(ТекущаяСтрока, "=") -1);
				Если ЗначениеЗаполнено(ТекущийТэг) Тогда
					Попытка
						Результат.Вставить(ТекущийТэг, СокрЛП(СтрЗаменить(ТекущаяСтрока, ТекущийТэг + "=", "")));
					Исключение 
						// Сообщить(ОписаниеОшибки() + ": " + ТекущийТэг);
					КонецПопытки;
				КонецЕсли;
				ТекущаяСтрока = ЧтениеТекста.ПрочитатьСтроку();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаСервере
//
//
Процедура СоздатьЗаписьАрхиваНаСервере(РелизОбновления) Экспорт
	НаборЗаписей = РегистрыСведений.ХранилищеРелизовОбновлений.СоздатьНаборЗаписей();
	ЭлементОтбора = НаборЗаписей.Отбор.РелизОбновления;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = РелизОбновления;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда 
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.РелизОбновления = РелизОбновления;
		НоваяЗапись.АрхивЗагруженВХранилище = Ложь;
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
КонецПроцедуры 