

//
//
Процедура ПередЗаписью(Отказ)
	
	Данные_UpdInfo = Справочники.РелизыОбновлений.Прочитать_UpdInfo(ЭтотОбъект.Каталог);
	Если Данные_UpdInfo.Свойство("Version") Тогда
		Попытка ЭтотОбъект.Наименование = Данные_UpdInfo.Version; Исключение КонецПопытки;		
	КонецЕсли;
	Если Данные_UpdInfo.Свойство("FromVersions") Тогда		
		Попытка ЭтотОбъект.UpdInfo = Данные_UpdInfo.FromVersions; Исключение КонецПопытки;
	КонецЕсли;
	
	Данные_1cv8_mft = Справочники.РелизыОбновлений.Прочитать_1cv8_mft(ЭтотОбъект.Каталог);
	Если Данные_1cv8_mft.Свойство("Version") Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
			Попытка ЭтотОбъект.Наименование = Данные_1cv8_mft.Version; Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Если Данные_1cv8_mft.Свойство("Name") Тогда
		ВыбранныйВидКонфигурации = СокрЛП(ЭтотОбъект.ВидКонфигурации.Наименование);
		Если ВРег(СокрЛП(Данные_1cv8_mft.Name)) <> ВРег(ВыбранныйВидКонфигурации) Тогда
			ОбщегоНазначенияСервер.ВывестиСообщение("Выбранный каталог содержит обновление [" + Данные_1cv8_mft.Name + "] отличное от заданного [" + ВыбранныйВидКонфигурации + "]");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.НомерДляСортировки = ОбщегоНазначенияСервер.ДополнитьНулямиЧисловыеЗначенияСтрокиРелиза(СокрЛП(ЭтотОбъект.Наименование));
	
КонецПроцедуры
