
//
//
Функция ПолучитьСообщенияССервера() Экспорт		
	
	Результат = Новый Массив;	
	
	НаборЗаписейОповещениеССервера = РегистрыСведений.ОповещениеССервера.СоздатьНаборЗаписей();
	НаборЗаписейОповещениеССервера.Прочитать();	
	
	Для Каждого ТекущаяСтрокаНаборЗаписейОповещениеССервера Из НаборЗаписейОповещениеССервера Цикл
		
		Результат.Добавить(Новый Структура("Сообщение, ТипОповещенияССервера, ПараметрыОбработки", ТекущаяСтрокаНаборЗаписейОповещениеССервера.Сообщение, ТекущаяСтрокаНаборЗаписейОповещениеССервера.ТипОповещенияССервера, ТекущаяСтрокаНаборЗаписейОповещениеССервера.ПараметрыОбработки.Получить()));
		
	КонецЦикла;
		
	Для Каждого ТекущаяСтрокаРезультат Из Результат Цикл
		
		НаборЗаписейОповещениеССервера.Отбор.Сообщение.Установить(ТекущаяСтрокаРезультат.Сообщение);
		НаборЗаписейОповещениеССервера.Прочитать();
		НаборЗаписейОповещениеССервера.Очистить();
		НаборЗаписейОповещениеССервера.Записать(Истина);
		
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции

//
//
Функция ОтправитьСообщениеССервера(ТипОповещенияССервера, ПараметрыОбработки) Экспорт
	
	Результат = Истина;
	
	//Если НЕ ОбщегоНазначенияСервер.ИнформационнаяБазаФайловая() Тогда
		
		Сообщение = Новый УникальныйИдентификатор;
		НаборЗаписейОповещениеССервера = РегистрыСведений.ОповещениеССервера.СоздатьНаборЗаписей();
		НаборЗаписейОповещениеССервера.Отбор.Сообщение.Установить(Сообщение);
		
		НоваяЗапись = НаборЗаписейОповещениеССервера.Добавить();
		НоваяЗапись.Сообщение = Сообщение;
		НоваяЗапись.ТипОповещенияССервера = ТипОповещенияССервера;
		НоваяЗапись.ПараметрыОбработки = Новый ХранилищеЗначения(ПараметрыОбработки, Новый СжатиеДанных(9));
		
		НаборЗаписейОповещениеССервера.Записать();
		
	//КонецЕсли;
	
	Возврат Результат;
КонецФункции