
&НаСервере
//
//
Функция СохранитьДвоичныеДанныеФайлаВыгрузкиВКаталог(ИнформационнаяБаза, ДатаСобытия, ТипАрхива, КаталогСохранения) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = ПолучитьПолныеДанныеЗаписи(ДатаСобытия, ИнформационнаяБаза, ТипАрхива);
	Если ДанныеЗаписи <> Неопределено Тогда
		Если ДанныеЗаписи.Количество() > 0 Тогда 
			ДвоичныеДанныеФайлаАрхива = ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива.Получить();			
			Попытка
				ДвоичныеДанныеФайлаАрхива.Записать(КаталогСохранения + ?(Прав(КаталогСохранения,3) = ".dt", "", ".dt"));
				Результат = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("СохранениеФайлаВыгрузки", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());				
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ЗагрузитьДвоичныеДанныеАрхиваИзФайла(ИнформационнаяБаза, ДатаСобытия, ТипАрхива, КаталогЗагрузки, флПерезаписыватьПутьКФайлуАрхива= Ложь) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.СоздатьМенеджерЗаписи();
	ДанныеЗаписи.ДатаСобытия = ДатаСобытия;
	ДанныеЗаписи.ИнформационнаяБаза = ИнформационнаяБаза.Ссылка;
	ДанныеЗаписи.Прочитать();
	Попытка
		Если ДанныеЗаписи.Выбран() Тогда		
			ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива = Новый ХранилищеЗначения(Новый ДвоичныеДанные(КаталогЗагрузки), Новый СжатиеДанных(9));
			ДанныеЗаписи.АрхивЗагруженВХранилище = Истина;
			Если флПерезаписыватьПутьКФайлуАрхива Тогда ДанныеЗаписи.ПутьКАрхиву = КаталогЗагрузки; КонецЕсли;			
			ДанныеЗаписи.Записать(Истина);
			Результат = Истина;
		КонецЕсли;		
	Исключение
		ЗаписьЖурналаРегистрации("ЗагрузкаФайлаВыгрузки", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());				
	КонецПопытки;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция УдалитьДвоичныеДанныеФайлаВыгрузки(ИнформационнаяБаза, ДатаСобытия, ТипАрхива) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.СоздатьМенеджерЗаписи();
	ДанныеЗаписи.ДатаСобытия = ДатаСобытия;
	ДанныеЗаписи.ИнформационнаяБаза = ИнформационнаяБаза.Ссылка;
	ДанныеЗаписи.ТипАрхива = ТипАрхива;
	ДанныеЗаписи.Прочитать();
	Попытка
		Если ДанныеЗаписи.Выбран() Тогда
			ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива = Новый ХранилищеЗначения(Неопределено);
			ДанныеЗаписи.АрхивЗагруженВХранилище = Ложь;
			ДанныеЗаписи.Записать(Истина);
			Результат = Истина;
		КонецЕсли;		
	Исключение
		ЗаписьЖурналаРегистрации("УдалениеДанныхАрхива", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ПолучитьПолныеДанныеЗаписи(ДатаСобытия, ИнформационнаяБаза, ТипАрхива) Экспорт
	ДанныеЗаписи = Неопределено;	
	Отбор = Новый Структура;	
	Отбор.Вставить("ИнформационнаяБаза", ИнформационнаяБаза.Ссылка);	
	Отбор.Вставить("ДатаСобытия", ДатаСобытия);
	Отбор.Вставить("ТипАрхива", ТипАрхива);
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.Получить(Отбор);
	ДанныеЗаписи.Вставить("ИнформационнаяБаза", ИнформационнаяБаза.Ссылка);
	ДанныеЗаписи.Вставить("ДатаСобытия", ДатаСобытия);
	Возврат ДанныеЗаписи;
КонецФункции

&НаСервере
//
//
Функция СформироватьИмяВременногоФайлаАрхива(ИнформационнаяБаза) Экспорт
	Возврат КаталогВременныхФайлов() + СокрЛП(ИнформационнаяБаза.Ссылка.УникальныйИдентификатор()) + ".dt";
КонецФункции
