
&НаСервере
//
//
Функция ПолучитьСписокПользователейПлатформы()
	СписокПользователейПлатформы = Элементы.Наименование.СписокВыбора;
	СписокПользователейПлатформы.Очистить();
	Для Каждого ТекущийПользовательПлатформы ИЗ ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Если ТекущийПользовательПлатформы.АутентификацияОС ИЛИ ТекущийПользовательПлатформы.АутентификацияСтандартная ИЛИ ТекущийПользовательПлатформы.АутентификацияOpenID Тогда
			СписокПользователейПлатформы.Добавить(ТекущийПользовательПлатформы.Имя, ТекущийПользовательПлатформы.ПолноеИмя);
		КонецЕсли;		
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаКлиенте
//
//
Процедура ИмяПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолучитьСписокПользователейПлатформы();
	Если Элементы.Наименование.СписокВыбора.Количество() = 0 Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Не заведен ни один пользователь на уровне платформы!");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьСписокПользователейПлатформы();
КонецПроцедуры
