
&НаКлиенте
//
//
Процедура УстановитьЗначенияПоУмолчанию(Команда)	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьЗначенияПоУмолчаниюОписаниеОповещенияВопросВосстановленияОбработчиковПоУмолчанию", ЭтаФорма), "Вы действительно хотите восстановить коды обработчиков по умолчанию?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УстановитьЗначенияПоУмолчаниюОписаниеОповещенияВопросВосстановленияОбработчиковПоУмолчанию(РезультатОповещения, ПараметрыОповещения) Экспорт
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		УстановитьЗначенияПоУмолчаниюНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
//
//
Процедура УстановитьЗначенияПоУмолчаниюНаСервере()
	Справочники.Обработчики.ВосстановитьЗаполнениеПредопределенныхЭлементов();
КонецПроцедуры


&НаКлиенте
//
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокВыборНаСервере(ВыбраннаяСтрока);
КонецПроцедуры


&НаСервере
//
//
Процедура СписокВыборНаСервере(ВыбраннаяСтрока)
	Если ВыбраннаяСтрока.Предопределенный И НЕ ЗначениеЗаполнено(ВыбраннаяСтрока.КодОбработчика) Тогда
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить(ВыбраннаяСтрока);
		Справочники.Обработчики.ВосстановитьЗаполнениеПредопределенныхЭлементов(МассивЭлементов);
	КонецЕсли;
КонецПроцедуры

