
//
//
Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ID) Тогда
		ЭтотОбъект.ID = СокрЛП(Новый УникальныйИдентификатор());
	КонецЕсли;
	Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.OrderInList) ИЛИ ЭтотОбъект.OrderInList <= 0) И НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.OrderInList = ЭтотОбъект.Код;
	ИначеЕсли ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.OrderInList = -1;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.OrderInTree) ИЛИ ЭтотОбъект.OrderInTree <= 0 Тогда
		ЭтотОбъект.OrderInTree = ЭтотОбъект.Код;
	КонецЕсли;
КонецПроцедуры

//
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.УстановитьНовыйКод();
КонецПроцедуры
