
// Общий модуль
//

&НаКлиенте
// Удаляет домен из логина пользователя
//
Функция УдалитьДомен(стрЛогин = "") Экспорт
	Результат = "";
	Если ЗначениеЗаполнено(стрЛогин) Тогда
		ПоследнийНомерСимволаРазделителя = 0;
		Для НомерСимвола = 1 По СтрДлина(стрЛогин) Цикл Если Сред(стрЛогин, НомерСимвола, 1) = "\" Тогда ПоследнийНомерСимволаРазделителя = НомерСимвола; КонецЕсли; КонецЦикла;
		Попытка
			Если ПоследнийНомерСимволаРазделителя <> 0 Тогда Результат = Сред(стрЛогин, ПоследнийНомерСимволаРазделителя + 1, СтрДлина(стрЛогин)); КонецЕсли;
		Исключение
			Результат = "";
		КонецПопытки;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
//
//
Функция ПолучитьПутьККаталогуПараметровСпискаБаз() Экспорт	
	ПутьККаталогуПараметровСпискаБаз = "";
	ТекушийПользователь = ОбщегоНазначенияКлиент.УдалитьДомен(ОбщегоНазначенияСервер.ПолучитьПользователяПараметрыАвторизацииОСТекущегоПользователя());
	Если НЕ ЗначениеЗаполнено(ТекушийПользователь) Тогда
		Попытка
			WshShell = Новый COMОбъект("WScript.Shell");
			WshSysEnv = WshShell.Environment("Process");
			ТекушийПользователь = WshSysEnv.Item("USERNAME");
			ПутьККаталогуПараметровСпискаБаз = "C:\Users\" + ТекушийПользователь + "\AppData\Roaming\1C\1CEStart\";
		Исключение
			ПутьККаталогуПараметровСпискаБаз = СтрЗаменить(КаталогВременныхФайлов(),"Local\Temp\", "Roaming\1C\1CEStart\");
		КонецПопытки;
	Иначе
		ПутьККаталогуПараметровСпискаБаз = "C:\Users\" + ТекушийПользователь + "\AppData\Roaming\1C\1CEStart\";
	КонецЕсли;		
	Возврат ПутьККаталогуПараметровСпискаБаз;	
КонецФункции

&НаКлиенте
//
//
Функция ПолучитьПутьКФайлуСпискаИнформационныхБаз() Экспорт
	Результат = Неопределено;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";	
	
	
	ПутьКСпискуБаз = ОбщегоНазначенияКлиент.ПолучитьПутьККаталогуПараметровСпискаБаз();
	
	СписокБазТекущегоПользователя = Новый Файл(ПутьКСпискуБаз + "ibases.v8i");	
	Если СписокБазТекущегоПользователя.Существует() Тогда
		ДиалогВыбораКаталога.Каталог = ПутьКСпискуБаз;	
	КонецЕсли;	
		
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл списка баз";
	Фильтр = "(*.v8i)|*.v8i";
	ДиалогВыбораКаталога.Фильтр = Фильтр;
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";
	Если ДиалогВыбораКаталога.Выбрать() Тогда		
		Результат = ДиалогВыбораКаталога.ПолноеИмяФайла;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
//
//
Функция ПолучитьДанныеПоОбъекту(Объект) Экспорт 
	Возврат ОбщегоНазначенияСервер.ПолучитьДанныеПоОбъекту(Объект);
КонецФункции