
&НаКлиенте
//
//
Процедура ПутьКАрхивуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";
	Если ЗначениеЗаполнено(Запись.ПутьКАрхиву) Тогда
		КаталогРасположения = Запись.ПутьКАрхиву;
		ДиалогВыбораКаталога.ПолноеИмяФайла = КаталогРасположения;
		ПолноеИмяФайлаАрхива = ЗадачиНаКлиенте.ПолучитьИмяФайлаАрхиваИзПолногоПути(КаталогРасположения);
		КаталогРасположения = СтрЗаменить(КаталогРасположения, ПолноеИмяФайлаАрхива, "");
	Иначе
		КаталогРасположения = ЗадачиНаСервере.ПолучитьОсновнойКаталогАрхива();
	КонецЕсли;	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл архива";
	Фильтр = "(*.dt)|*.dt";
	ДиалогВыбораКаталога.Фильтр = Фильтр;
	ДиалогВыбораКаталога.Каталог = КаталогРасположения;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Запись.ПутьКАрхиву = ДиалогВыбораКаталога.ПолноеИмяФайла;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
//
//
Функция ЭтоНовый()	
	Возврат НЕ ЗначениеЗаполнено(Параметры.Ключ);
КонецФункции

&НаКлиенте
//
//
Процедура УправлениеЭлементамиФормы()
	ТекущийОбъект = ЭтаФорма.Запись;
	флДоступностьОперацийСАрхивами = ТекущийОбъект.АрхивЗагруженВХранилище И НЕ ЭтоНовый();
	Элементы.ДекорацияФайлАрхиваЗагружен.Видимость = флДоступностьОперацийСАрхивами;
	Элементы.СохранитьДвоичныеДанныеАрхиваВФайл.Доступность = флДоступностьОперацийСАрхивами;
	Элементы.УдалитьДвоичныеДанныеАрхива.Доступность = флДоступностьОперацийСАрхивами;
	Элементы.ЗагрузитьДвоичныеДанныеАрхиваИзФайла.Доступность = НЕ ЭтоНовый();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
//
//
Функция СохранитьДвоичныеДанныеАрхиваВФайлНаСервере(КаталогСохранения)
	Возврат РегистрыСведений.ХранилищеАрхивов.СохранитьДвоичныеДанныеФайлаВыгрузкиВКаталог(Запись.ИнформационнаяБаза, Запись.ДатаСобытия, Запись.ТипАрхива, КаталогСохранения); 
КонецФункции 
	
&НаКлиенте
//
//
Процедура СохранитьДвоичныеДанныеАрхиваВФайл(Команда)
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";
	Если ЗначениеЗаполнено(Запись.ПутьКАрхиву) Тогда
		КаталогРасположения = Запись.ПутьКАрхиву;		
		ИмяФайлаАрхива = ЗадачиНаКлиенте.ПолучитьИмяФайлаАрхиваИзПолногоПути(КаталогРасположения);
		ДиалогВыбораКаталога.ПолноеИмяФайла = ИмяФайлаАрхива;
		КаталогРасположения = СтрЗаменить(КаталогРасположения, ИмяФайлаАрхива, "");
	Иначе
		КаталогРасположения = ЗадачиНаСервере.ПолучитьОсновнойКаталогАрхива();
	КонецЕсли;	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл архива";
	Фильтр = ?(Запись.ТипАрхива = ПредопределенноеЗначение("Перечисление.ТипыФайловАрхива.Архив1С"), "(*.dt)|*.dt", "(*.bak)|*.bak");
	ДиалогВыбораКаталога.Фильтр = Фильтр;
	ДиалогВыбораКаталога.Каталог = КаталогРасположения;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Если СохранитьДвоичныеДанныеАрхиваВФайлНаСервере(ДиалогВыбораКаталога.ПолноеИмяФайла) Тогда
			ПоказатьПредупреждение(, "Файл успешно сохранен.");
		Иначе 
			ПоказатьПредупреждение(, "Ошибка при выполнении операции!" + Символы.ПС + "Подробное описание ошибки записано в журнал регистрации");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УдалитьДвоичныеДанныеАрхива(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("", ЭтаФорма,), "Вы уверены, что хотите удалить данные файла выгрузки из хранилища?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
//
//
Процедура УдалитьДвоичныеДанныеАрхиваОписаниеОповещенияВопросУдаленияДанных(РезультатОповещения, ПараметрыОповещения) Экспорт
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда 
		
		флУспешно = УдалитьДвоичныеДанныеАрхиваНаСервере();
		
		ЭтаФорма.Прочитать();
		УправлениеЭлементамиФормы();
		
		Если флУспешно Тогда
			
			ПоказатьПредупреждение(, "Данные удалены.");
			
		Иначе 
			
			ПоказатьПредупреждение(, "Ошибка при выполнении операции!" + Символы.ПС + "Подробное описание ошибки записано в журнал регистрации");
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры


&НаСервере
//
//
Функция УдалитьДвоичныеДанныеАрхиваНаСервере()
	Возврат РегистрыСведений.ХранилищеАрхивов.УдалитьДвоичныеДанныеФайлаВыгрузки(Запись.ИнформационнаяБаза, Запись.ДатаСобытия, Запись.ТипАрхива);
КонецФункции

&НаКлиенте
//
//
Процедура ЗагрузитьДвоичныеДанныеАрхиваИзФайла(Команда)
	
	Если Запись.АрхивЗагруженВХранилище Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьДвоичныеДанныеАрхиваИзФайлаОписаниеОповещенияПерезаписьАрхива", ЭтаФорма), "При загрузке существующие данные файла архива будут перезаписаны. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗагрузитьДвоичныеДанныеАрхиваИзФайлаОписаниеОповещенияПерезаписьАрхива(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗагрузитьДвоичныеДанныеАрхиваИзФайлаОписаниеОповещенияПерезаписьАрхива(РезультатОповещения, ПараметрыОповещения) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда Возврат; КонецЕсли;	
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКаталога.ПолноеИмяФайла = "";
	Если ЗначениеЗаполнено(Запись.ПутьКАрхиву) Тогда
		КаталогРасположения = Запись.ПутьКАрхиву;		
		ИмяФайлаАрхива = ЗадачиНаКлиенте.ПолучитьИмяФайлаАрхиваИзПолногоПути(КаталогРасположения);
		ДиалогВыбораКаталога.ПолноеИмяФайла = ИмяФайлаАрхива;
		КаталогРасположения = СтрЗаменить(КаталогРасположения, ИмяФайлаАрхива, "");
	Иначе
		КаталогРасположения = ЗадачиНаСервере.ПолучитьОсновнойКаталогАрхива();
	КонецЕсли;
	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите файл архива";
	Фильтр = ?(Запись.ТипАрхива = ПредопределенноеЗначение("Перечисление.ТипыФайловАрхива.Архив1С"), "(*.dt)|*.dt", "(*.bak)|*.bak");
	ДиалогВыбораКаталога.Фильтр = Фильтр;
	ДиалогВыбораКаталога.Каталог = КаталогРасположения;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		
		ПараметрыОповещения = Новый Структура("ПолноеИмяФайла", ДиалогВыбораКаталога.ПолноеИмяФайла);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьДвоичныеДанныеАрхиваИзФайлаОписаниеОповещенияЗагрузитьДанные", ЭтаФорма, ПараметрыОповещения), "Обновить сведения о пути к внешнему файлу архива?", РежимДиалогаВопрос.ДаНет);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗагрузитьДвоичныеДанныеАрхиваИзФайлаОписаниеОповещенияЗагрузитьДанные(РезультатОповещения, ПараметрыОповещения) Экспорт
	
	флУспешно = ЗагрузитьДвоичныеДанныеАрхиваИзФайлаНаСервере(ПараметрыОповещения.ПолноеИмяФайла, (РезультатОповещения = КодВозвратаДиалога.Да));
	
	ЭтаФорма.Прочитать();
	УправлениеЭлементамиФормы();
	
	Если флУспешно Тогда
		
		ПоказатьПредупреждение(, "Данные загружены.");
		
	Иначе 
		
		ПоказатьПредупреждение(,"Ошибка при выполнении операции!" + Символы.ПС + "Подробное описание ошибки записано в журнал регистрации");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//
//
Функция ЗагрузитьДвоичныеДанныеАрхиваИзФайлаНаСервере(КаталогЗагрузки, флПерезаписыватьПутьКФайлуАрхива)
	Возврат РегистрыСведений.ХранилищеАрхивов.ЗагрузитьДвоичныеДанныеАрхиваИзФайла(Запись.ИнформационнаяБаза, Запись.ДатаСобытия, Запись.ТипАрхива, КаталогЗагрузки, флПерезаписыватьПутьКФайлуАрхива);
КонецФункции


