
&НаКлиенте
//
//
Процедура УправлениеЭлементамиФормы()
	флИнформационнаяБазаФайловая = ОбщегоНазначенияСервер.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы());
	Элементы.ЗагружатьОбновленияКонфигурацийАвтоматически.Доступность = НЕ флИнформационнаяБазаФайловая;
	Элементы.ЗагружатьРелизыОбновленийВХранилище.Доступность = НаборКонстант.ЗагружатьРелизыОбновленийАвтоматически;
	Элементы.ВыполнятьРегламентнуюОбработкуДанных.Доступность = НЕ флИнформационнаяБазаФайловая;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОсновнойКаталогАрхиваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог ИБ";
	ДиалогВыбораКаталога.Каталог = НаборКонстант.ОсновнойКаталогАрхива;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.НаборКонстант.ОсновнойКаталогАрхива = ДиалогВыбораКаталога.Каталог;				
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогОбновленийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог обновлений";
	ДиалогВыбораКаталога.Каталог = НаборКонстант.КаталогОбновлений;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.НаборКонстант.КаталогОбновлений = ДиалогВыбораКаталога.Каталог;				
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ШаблонHTMLYandex = ПолучитьОбщийМакет("IFrameПоддержкаПроектаYandex");	
	ВывестиШаблонВПоле(ЭтаФорма.ПолеДонатYandex, ШаблонHTMLYandex);
	
	ШаблонHTMLWebMoney = ПолучитьОбщийМакет("IFrameПоддержкаПроектаWebMoney");	
	ВывестиШаблонВПоле(ЭтаФорма.ПолеДонатWebMoney, ШаблонHTMLWebMoney);
	
КонецПроцедуры

&НаСервере
//
//
Процедура ВывестиШаблонВПоле(ПолеДонат, ШаблонHTML)
	Для НомерСтрокаШаблонаHTML = 1 По ШаблонHTML.КоличествоСтрок() Цикл
		ПолеДонат = ПолеДонат + СокрЛП(ШаблонHTML.ПолучитьСтроку(НомерСтрокаШаблонаHTML));
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗагружатьОбновленияКонфигурацийАвтоматическиПриИзменении(Элемент)
	УправлениеЭлементамиФормы()
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
//
//
Процедура ПроверитьОбновленияНаСервере()
	ОбновлениеВерсииКонфигурации.ЗагрузитьОбновленияКонфигурацииАИБ();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПроверитьОбновления(Команда)
	ПроверитьОбновленияНаСервере();
КонецПроцедуры
