
&НаКлиенте
//
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	Попытка
		Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
			СообщениеБыстрыйВывод = Элемент.ТекущиеДанные.Сообщение;
		КонецЕсли;
	Исключение
		СообщениеБыстрыйВывод = "";
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
//
//
Процедура СократитьЖурнал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();	
	Диалог.Период = Новый СтандартныйПериод;
	Если Диалог.Редактировать() Тогда 
    	СократитьЖурналНаСервере(Диалог.Период);
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
//
//
Процедура СократитьЖурналНаСервере(ВыбранныйПериод)
	
	ДатаНачала = ВыбранныйПериод.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(ВыбранныйПериод.ДатаОкончания), ВыбранныйПериод.ДатаОкончания, ДобавитьМесяц(ТекущаяДатаСеанса(), 100));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналЛогов.ДатаСобытия,
		|	ЖурналЛогов.ИнформационнаяБаза,
		|	ЖурналЛогов.ВидОбработки,
		|	ЖурналЛогов.ВыполненоУспешно,
		|	ЖурналЛогов.Сообщение
		|ИЗ
		|	РегистрСведений.ЖурналЛогов КАК ЖурналЛогов
		|ГДЕ
		|	НЕ(ЖурналЛогов.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|
		|ДЛЯ ИЗМЕНЕНИЯ";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	НаборЗаписей = РегистрыСведений.ЖурналЛогов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
		
КонецПроцедуры
