
//
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() И НЕ Отказ Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ.Ссылка
		|ИЗ
		|	Справочник.ДоступКСпискамИнформационныхБаз.ДоступныеСпискиОбщихИБ КАК ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ
		|ГДЕ
		|	ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ.СписокОбщихИБ = &СписокОбщихИБ";	
		Запрос.УстановитьПараметр("СписокОбщихИБ", ЭтотОбъект.Ссылка);		
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекущийОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
